// 1. Створити пустий масив та :
//     a. заповнити його 50 парними числами за допомоги циклу.
//     b. заповнити його 50 непарними числами за допомоги циклу.
//     c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
// d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)
// 2. Вивести за допомогою console.log кожен третій елемен
// 3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
// 4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
// 5. Вивести кожен елемент масиву, сусід справа якого є парним
// EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
// 6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
//
// 7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// 8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив.
//
//
//
// - Дано 2 масиви з рівною кількістю об'єктів.
// Масиви:
//     let usersWithId = [
//         {id: 1, name: 'vasya', age: 31, status: false},
//         {id: 2, name: 'petya', age: 30, status: true},
//         {id: 3, name: 'kolya', age: 29, status: true},
//         {id: 4, name: 'olya', age: 28, status: false}
//     ];
//
// let citiesWithId = [
//     {user_id: 3, country: 'USA', city: 'Portland'},
//     {user_id: 1, country: 'Ukraine', city: 'Ternopil'},
//     {user_id: 2, country: 'Poland', city: 'Krakow'},
//     {user_id: 4, country: 'USA', city: 'Miami'}
// ];
//
// З'єднати в один об'єкт користувача та місто з відповідними "id" та "user_id" .
//     Записати цей об'єкт в новий масив
// Example:
//     let usersWithCities = [
//             {
//                 id: 1, // <===
//                 name: 'vasya',
//                 age: 31,
//                 status: false,
//                 address: {
//                     user_id: 1, // <===
//                     country: 'Ukraine',
//                     city: 'Ternopil'
//                 }
//             },
//             // TO BE CONTINUED .....
//         ]
//
//
//
//
//         - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
//
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
//
//
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
//
// © 2021 GitHub, Inc.
//     Terms
// Privacy
// Security
// Status
// Docs


// 1. Створити пустий масив та :
//     a. заповнити його 50 парними числами за допомоги циклу.
//     b. заповнити його 50 непарними числами за допомоги циклу.
//     c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
// d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732

// a. заповнити його 50 парними числами за допомоги циклу.
// let arr = [];
// for (let i = 0; i < 50; i++) {
//     arr[i] = (i+1)*2;
// console.log(arr[i])
// }

//     b. заповнити його 50 непарними числами за допомоги циклу.
// let www = [];
// for (let i = 0; i<50 ; i++ ) {
//     www[i] = (i*2)+1;
//         console.log(www[i]);
// }

// c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
// let ar = [];
// for (let i = 0; i < 20; i++) {
//     ar[i] =  Math.floor(Math.random() *100);
//         console.log(ar[i]);

// d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732
// let ar = [];
// for (let i = 0; i < 20; i++) {
//     ar[i] = Math.floor(Math.random() * 732 + 8);
//     console.log(ar[i]);
// }

// 2. Вивести за допомогою console.log кожен третій елемен
// let arr = [];
// for (let i = 0; i < 20; i++) {
//     arr[i] = i;
//     if ( (i % 3) === 2) {
//         console.log(arr[i]);
//     }
// }

// 3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
// let arr = [];
// for (let i = 0; i < 20; i++) {
//     arr[i] = i;
//     if ( (i % 3) === 2) {
//         if ( i%2 === 0) {
//             console.log(arr[i]);
//         }
//     }
// }

// 4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
// let arr = [];
// let arr2 = [];
// let a = 0;
//  for (let i = 0; i < 20; i++) {
//      arr[i] = i;
//      if ( (i % 3) === 2) {
//          if ( i%2 === 0) {
//
//               arr2[a]=arr[i];
//                 a++;
//                 // з цим бавився дуже довго
//
//              }
//          }
//      }
// for (let i = 0; i < arr2.length; i++) {
//     console.log(arr2[i]);
// }

// Вивести кожен елемент масиву, сусід справа якого є парним
// EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
// let arr = [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ];
//  for (let i = 1; i < arr.length; i++) {
//
//      if (arr[i] % 2 === 0) {
//          console.log(arr[i-1]);
//      }
//  }

//6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
// let arr = [100,250,50,168,120,345,188];
// let  a = 0;
// let c;
// for (let i = 0; i < arr.length; i++) {
//    a= a + arr[i];
// }
// c = a / arr.length;
// console.log(a);
// console.log(c);

// 7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// let ar = [];
// let ar2 = [];
// let w =0;
// let a = 0;
// for (let i = 0; i <20; i++) {
//     ar[i] = Math.floor(Math.random()*100);
//
//     ar2[a] = ar[i] * 5;
//     //console.log(ar2[a]);
//     a++
//
//     }
// for (let i = 0; i < ar2.length; i++) {
//     console.log(ar2[i]);
// }

//8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив.