// Всі функції повинні бути описані стрілочним типом!!!!
//     - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)
// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)
// - створити функцію яка повертає найбільше число з масиву
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.
// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);
// - створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.
// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.
// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].


//- створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)
// let comparison = (a, b, c) => {
//     if (a < b && a < c) {
//         console.log(a)
//     } else if (b < a && b < c) {
//         console.log(b);
//     } else {
//         console.log(c);
//     }
// };
// comparison(23, 45, 12);

// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)
// let comparison = (a, b, c) => {
//     if (a > b && a > c) {
//         console.log(a)
//     } else if (b > a && b > c) {
//         console.log(b);
//     } else {
//         console.log(c);
//     }
// };
// comparison(23, 45, 12);

// - створити функцію яка повертає найбільше число з масиву
// let comparison = (...arr) => {
//     let max = arr[0];
//     for (const arrElement of arr) {
//         if (arrElement > max) {
//             max = arrElement;
//         } else {
//         }
//     }
//    return max;
// };
// let asd = comparison(23,45,67,98,12);
// console.log(asd+2);

// - створити функцію яка повертає найменьше число з масиву
// let comparison = (...arr) => {
//     let min = arr[0];
//     for (const arrElement of arr) {
//         if (arrElement < min) {
//            min = arrElement;
//         } else {
//         }
//     }
//    return min;
// };
// let asd = comparison(23,45,67,98,12);
// console.log(asd);

// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
// let camel = (...arr) => {
//     let sum = 0;
//     for (const arrElement of arr) {
//         sum += arrElement;
//     }
//     console.log(sum);
// };
// camel(100,200,300,400,500);

// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.
// let camel = (...arr) => {
//     let sum = 0;
//     for (const arrElement of arr) {
//         sum += arrElement / arr.length;
//     }
//     return sum;
// };
// console.log(camel(10, 20, 30, 50, 50));

// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);
// let zebra = (...arr) => {
//     let max = arr[0];
//     let min = arr[0];
//     for (const arrElement of arr) {
//         if (max > arrElement) {
//             max = arrElement;
//         } else {}
//         if (min < arrElement) {
//             min = arrElement;
//         } else {}
//     }
//     console.log(max);
//     return min;
// };
// console.log(zebra(23, 34, 65, 89, 4365, 23));

// - створити функцію яка заповнює масив рандомними числами
// let manky = () => {
//     let arr = [];
//     for (let i = 0; i < 10; i++) {
//         arr[i] = Math.round(Math.random() * 100);
//     }
//     console.log(arr);
// };
// manky();

// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.
// let manky = (limit) => {
//     let arr = [];
//     for (let i = 0; i < 10; i++) {
//         arr[i] = Math.round(Math.random() * limit);
//     }
//     console.log(arr);
// };
// manky(500);

// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].
// let ruslan = (arr) => {
//     let new_arr = [];
//     for (let i = 0, ri = arr.length - 1;   i<arr.length ; i++, ri--) {
//          new_arr[ri] = arr[i];
//     }
//     return new_arr;
// };
// console.log(ruslan([22,33,44,55]));
