// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
//
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
//
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
//
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write


// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль

// let array = [55, 22, 44];
// let array2 = ['fff','bbb','ccc'];
// let array3 = ['fff', 1, 2, false, false];
// console.log(array, array2, array3);




// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

// let array = [];
// array [0] = 12;
// array [1] = 13;
// array [2] = 18;
// console.log(array);



// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.v

// for (let i = 0; i < 10; i++) {
//     document.write(`<div>item ${i}</div>`);
// }
//
// let i = 0;
// while (i < 20) {
//
//     document.write('<h1> fhfhfhfh</h1>');
//
//
//     i++;
// }
//
// let i2 = 0;
// while (i2 < 20) {
//
//
//     document.write(`<h1> dog ${i2}</h1>`);
//
//     i2++;
// }


// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//

// let array = [1, 3, 4, 5, 6, 77, 88, 99, 10, 11];
// for (let i = 0; i < 10; i++) {
//     console.log(array[i]);
// }
//
// let array2 = ['fg', 'dg', 'ccb', 'dbc', 'xbr', '77', 'xvd db', 'vcvcvcv', 'dvdv', 'dvbdb'];
// for (let i = 0; i < 10; i++) {
//     console.log(array2[i]);
// }
//
// let array3 = [1, 'dg', 'ccb', 234, false, true, 'xvd db', 'vcvcvcv', 345, [34,56,78]];
// for (let i = 0; i < 10; i++) {
//     console.log(array3[i]);
//     console.log('=============');
// }

// let arr = [false, 'dg', 'ccb', 234, false, true, 'xvd db', 'vcvcvcv', false, 23, true];
// for (let i = 0; i <arr.length ; i++) {
//     if (typeof arr[i] === 'boolean') {
//         console.log(arr[i] +' '+ [i]);
//     }
// }
//
//
// let arr2 = [false, 'dg', 'ccb', 234, false, true, 'xvd db', 'vcvcvcv', false, 23, true];
// for (let i = 0; i <arr2.length ; i++) {
//     if (typeof arr2[i] === 'number') {
//         console.log(arr2[i] +' '+ [i]);
//     }
// }

let arr2 = [false, 'dg', 'ccb', 234, false, true, 'xvd db', 'vcvcvcv', false, 23, true];
for (let i = 0; i <arr2.length ; i++) {
    if (typeof arr2[i] === 'string') {
        console.log(arr2[i] +' '+ [i]);
    }
}