// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
// - створити функцію яка обчислює та повертає площу кола з радіусом r
// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
// - створити функцію яка приймає масив та виводить кожен його елемент
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
//
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.


// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
// function S (a,b) {
//     return a * b;
// }
// S(2,6);

// - створити функцію яка обчислює та повертає площу кола з радіусом r
// function SSS( r){
// let pi = 3.14;
//  return Math.pow(r,2) * pi ;
// }
// SSS(7);

// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
// function qq(R, h) {
//     return Math.pow(R, 2) * h;
// }
//
// qq(5,4);

// - створити функцію яка приймає масив та виводить кожен його елемент
// function def () {
//     let ar = [1,2,3,4,45,67];
//     for (let i = 0; i <ar.length; i++) {
//         console.log(ar[i]);
//     }
// }
// def();

// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
// function text(p) {
//     document.write(`<p>${p}</p>`)
// }
// text('dkdkdkdkdkdkdkdkdkkdkdkdkdkdkdk');

// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// function l(t) {
//     document.write(`<ul>
//         <li>${t}</li>
//         <li>${t}</li>
//         <li>${t}</li>
//     </ul>`);
// }
// l('brother');

// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// function DDD(t,s) {
//
//     for (let i = 0; i < s; i++) {
//         document.write(`<ul><li> ${t} </li></ul>`);
//
//     }
// }
// DDD('sun',5);

// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// function web(ar) {
//     for (const item of ar) {
//         console.log(item);
//     }
// }
// web([1,2,3]);

 // - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
 // function rrr(ar) {
 //     for (const item of ar) {
 //         document.write(`<h1>${item}</h1>`);
 //     }
 //     }
 // rrr(['id', 'name', 'age']);
